{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "BertNormalizer",
        "clean_text": true,
        "handle_chinese_chars": true,
        "strip_accents": null,
        "lowercase": false
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "</w>",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "1": 1,
      "a": 2,
      "b": 3,
      "c": 4,
      "d": 5,
      "e": 6,
      "f": 7,
      "g": 8,
      "h": 9,
      "i": 10,
      "j": 11,
      "k": 12,
      "l": 13,
      "m": 14,
      "n": 15,
      "o": 16,
      "p": 17,
      "q": 18,
      "r": 19,
      "s": 20,
      "t": 21,
      "u": 22,
      "v": 23,
      "w": 24,
      "x": 25,
      "y": 26,
      "z": 27,
      "d</w>": 28,
      "b</w>": 29,
      "e</w>": 30,
      "a</w>": 31,
      "l</w>": 32,
      "c</w>": 33,
      "g</w>": 34,
      "j</w>": 35,
      "h</w>": 36,
      "f</w>": 37,
      "s</w>": 38,
      "q</w>": 39,
      "k</w>": 40,
      "t</w>": 41,
      "r</w>": 42,
      "o</w>": 43,
      "i</w>": 44,
      "m</w>": 45,
      "v</w>": 46,
      "u</w>": 47,
      "p</w>": 48,
      "n</w>": 49,
      "x</w>": 50,
      "1</w>": 51,
      "y</w>": 52,
      "z</w>": 53,
      "w</w>": 54,
      "aa": 55,
      "bb": 56,
      "cc": 57,
      "dd": 58,
      "aaaa": 59,
      "ab": 60,
      "bbbb": 61,
      "ad": 62,
      "ac": 63,
      "ee": 64,
      "ff": 65,
      "ag": 66,
      "ae": 67,
      "bbb": 68,
      "af": 69,
      "ii": 70,
      "acc": 71,
      "cd": 72,
      "hh": 73,
      "aab": 74,
      "add": 75,
      "db": 76,
      "cb": 77,
      "ll": 78,
      "abb": 79,
      "cccc": 80,
      "gg": 81,
      "aad": 82,
      "aac": 83,
      "aaa": 84,
      "ddd": 85,
      "kk": 86,
      "bbbbbbbb": 87,
      "eb": 88,
      "ed": 89,
      "ai": 90,
      "jj": 91,
      "bd": 92,
      "ccc": 93,
      "aag": 94,
      "aaaaaaaa": 95,
      "aaab": 96,
      "fd": 97,
      "aae": 98,
      "fb": 99,
      "dddd": 100,
      "dc": 101,
      "ah": 102,
      "aj": 103,
      "ak": 104,
      "aaf": 105,
      "aaac": 106,
      "an": 107,
      "bc": 108,
      "gd": 109,
      "am": 110,
      "fc": 111,
      "ec": 112,
      "gb": 113,
      "aaad": 114,
      "al": 115,
      "id": 116,
      "nn": 117,
      "abbb": 118,
      "bbbbb": 119,
      "aee": 120,
      "aabb": 121,
      "hb": 122,
      "gc": 123,
      "ao": 124,
      "tt": 125,
      "eeee": 126,
      "kb": 127,
      "aff": 128,
      "adb": 129,
      "aaag": 130,
      "mm": 131,
      "acd": 132,
      "ccd": 133,
      "ib": 134,
      "aaae": 135,
      "abd": 136,
      "acb": 137,
      "aacc": 138,
      "pp": 139,
      "ss": 140,
      "ld": 141,
      "llll": 142,
      "ffff": 143,
      "ddb": 144,
      "abbbb": 145,
      "ef": 146,
      "aaaab": 147,
      "bbd": 148,
      "ddc": 149,
      "ccb": 150,
      "adc": 151,
      "abc": 152,
      "de": 153,
      "accc": 154,
      "hhhh": 155,
      "aaaf": 156,
      "aadd": 157,
      "eg": 158,
      "aai": 159,
      "addd": 160,
      "ebb": 161,
      "uu": 162,
      "cdc": 163,
      "bbbbbb": 164,
      "fe": 165,
      "fg": 166,
      "hd": 167,
      "lb": 168,
      "jd": 169,
      "aeb": 170,
      "adad": 171,
      "aq": 172,
      "bbc": 173,
      "abab": 174,
      "iii": 175,
      "oo": 176,
      "bbbbbbbbbbbbbbbb": 177,
      "jb": 178,
      "agg": 179,
      "ce": 180,
      "aed": 181,
      "cac": 182,
      "eee": 183,
      "cf": 184,
      "fff": 185,
      "aak": 186,
      "ar": 187,
      "nb": 188,
      "dbd": 189,
      "cg": 190,
      "aaabb": 191,
      "aaj": 192,
      "ap": 193,
      "aah": 194,
      "edd": 195,
      "aii": 196,
      "nd": 197,
      "acac": 198,
      "agb": 199,
      "vv": 200,
      "abe": 201,
      "gf": 202,
      "aam": 203,
      "kd": 204,
      "if": 205,
      "ge": 206,
      "aaaac": 207,
      "afb": 208,
      "ic": 209,
      "bbbbbbb": 210,
      "ww": 211,
      "aaaad": 212,
      "agd": 213,
      "aabbb": 214,
      "mb": 215,
      "hc": 216,
      "abg": 217,
      "md": 218,
      "ig": 219,
      "aaacc": 220,
      "afd": 221,
      "fbb": 222,
      "aaaaab": 223,
      "ade": 224,
      "ahh": 225,
      "od": 226,
      "eeb": 227,
      "ne": 228,
      "cccccccc": 229,
      "cbc": 230,
      "fdd": 231,
      "ob": 232,
      "cdd": 233,
      "adg": 234,
      "cdb": 235,
      "aan": 236,
      "aacb": 237,
      "fcc": 238,
      "bbe": 239,
      "jc": 240,
      "he": 241,
      "akk": 242,
      "abf": 243,
      "aadb": 244,
      "aal": 245,
      "qq": 246,
      "hbb": 247,
      "kbb": 248,
      "fi": 249,
      "acg": 250,
      "acccc": 251,
      "rr": 252,
      "ace": 253,
      "aaadd": 254,
      "abaaaa": 255
    },
    "merges": [
      [
        "a",
        "a"
      ],
      [
        "b",
        "b"
      ],
      [
        "c",
        "c"
      ],
      [
        "d",
        "d"
      ],
      [
        "aa",
        "aa"
      ],
      [
        "a",
        "b"
      ],
      [
        "bb",
        "bb"
      ],
      [
        "a",
        "d"
      ],
      [
        "a",
        "c"
      ],
      [
        "e",
        "e"
      ],
      [
        "f",
        "f"
      ],
      [
        "a",
        "g"
      ],
      [
        "a",
        "e"
      ],
      [
        "bb",
        "b"
      ],
      [
        "a",
        "f"
      ],
      [
        "i",
        "i"
      ],
      [
        "a",
        "cc"
      ],
      [
        "c",
        "d"
      ],
      [
        "h",
        "h"
      ],
      [
        "aa",
        "b"
      ],
      [
        "a",
        "dd"
      ],
      [
        "d",
        "b"
      ],
      [
        "c",
        "b"
      ],
      [
        "l",
        "l"
      ],
      [
        "a",
        "bb"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "g",
        "g"
      ],
      [
        "aa",
        "d"
      ],
      [
        "aa",
        "c"
      ],
      [
        "aa",
        "a"
      ],
      [
        "dd",
        "d"
      ],
      [
        "k",
        "k"
      ],
      [
        "bbbb",
        "bbbb"
      ],
      [
        "e",
        "b"
      ],
      [
        "e",
        "d"
      ],
      [
        "a",
        "i"
      ],
      [
        "j",
        "j"
      ],
      [
        "b",
        "d"
      ],
      [
        "cc",
        "c"
      ],
      [
        "aa",
        "g"
      ],
      [
        "aaaa",
        "aaaa"
      ],
      [
        "aa",
        "ab"
      ],
      [
        "f",
        "d"
      ],
      [
        "aa",
        "e"
      ],
      [
        "f",
        "b"
      ],
      [
        "dd",
        "dd"
      ],
      [
        "d",
        "c"
      ],
      [
        "a",
        "h"
      ],
      [
        "a",
        "j"
      ],
      [
        "a",
        "k"
      ],
      [
        "aa",
        "f"
      ],
      [
        "aa",
        "ac"
      ],
      [
        "a",
        "n"
      ],
      [
        "b",
        "c"
      ],
      [
        "g",
        "d"
      ],
      [
        "a",
        "m"
      ],
      [
        "f",
        "c"
      ],
      [
        "e",
        "c"
      ],
      [
        "g",
        "b"
      ],
      [
        "aa",
        "ad"
      ],
      [
        "a",
        "l"
      ],
      [
        "i",
        "d"
      ],
      [
        "n",
        "n"
      ],
      [
        "a",
        "bbb"
      ],
      [
        "bbbb",
        "b"
      ],
      [
        "a",
        "ee"
      ],
      [
        "aa",
        "bb"
      ],
      [
        "h",
        "b"
      ],
      [
        "g",
        "c"
      ],
      [
        "a",
        "o"
      ],
      [
        "t",
        "t"
      ],
      [
        "ee",
        "ee"
      ],
      [
        "k",
        "b"
      ],
      [
        "a",
        "ff"
      ],
      [
        "ad",
        "b"
      ],
      [
        "aa",
        "ag"
      ],
      [
        "m",
        "m"
      ],
      [
        "ac",
        "d"
      ],
      [
        "cc",
        "d"
      ],
      [
        "i",
        "b"
      ],
      [
        "aa",
        "ae"
      ],
      [
        "ab",
        "d"
      ],
      [
        "ac",
        "b"
      ],
      [
        "aa",
        "cc"
      ],
      [
        "p",
        "p"
      ],
      [
        "s",
        "s"
      ],
      [
        "l",
        "d"
      ],
      [
        "ll",
        "ll"
      ],
      [
        "ff",
        "ff"
      ],
      [
        "dd",
        "b"
      ],
      [
        "a",
        "bbbb"
      ],
      [
        "e",
        "f"
      ],
      [
        "aaaa",
        "b"
      ],
      [
        "bb",
        "d"
      ],
      [
        "dd",
        "c"
      ],
      [
        "cc",
        "b"
      ],
      [
        "ad",
        "c"
      ],
      [
        "ab",
        "c"
      ],
      [
        "d",
        "e"
      ],
      [
        "acc",
        "c"
      ],
      [
        "hh",
        "hh"
      ],
      [
        "aa",
        "af"
      ],
      [
        "aa",
        "dd"
      ],
      [
        "e",
        "g"
      ],
      [
        "aa",
        "i"
      ],
      [
        "add",
        "d"
      ],
      [
        "e",
        "bb"
      ],
      [
        "u",
        "u"
      ],
      [
        "cd",
        "c"
      ],
      [
        "bbbb",
        "bb"
      ],
      [
        "f",
        "e"
      ],
      [
        "f",
        "g"
      ],
      [
        "h",
        "d"
      ],
      [
        "l",
        "b"
      ],
      [
        "j",
        "d"
      ],
      [
        "ae",
        "b"
      ],
      [
        "ad",
        "ad"
      ],
      [
        "a",
        "q"
      ],
      [
        "bb",
        "c"
      ],
      [
        "ab",
        "ab"
      ],
      [
        "ii",
        "i"
      ],
      [
        "o",
        "o"
      ],
      [
        "bbbbbbbb",
        "bbbbbbbb"
      ],
      [
        "j",
        "b"
      ],
      [
        "ag",
        "g"
      ],
      [
        "c",
        "e"
      ],
      [
        "ae",
        "d"
      ],
      [
        "c",
        "ac"
      ],
      [
        "ee",
        "e"
      ],
      [
        "c",
        "f"
      ],
      [
        "ff",
        "f"
      ],
      [
        "aa",
        "k"
      ],
      [
        "a",
        "r"
      ],
      [
        "n",
        "b"
      ],
      [
        "db",
        "d"
      ],
      [
        "c",
        "g"
      ],
      [
        "aa",
        "abb"
      ],
      [
        "aa",
        "j"
      ],
      [
        "a",
        "p"
      ],
      [
        "aa",
        "h"
      ],
      [
        "e",
        "dd"
      ],
      [
        "a",
        "ii"
      ],
      [
        "n",
        "d"
      ],
      [
        "ac",
        "ac"
      ],
      [
        "ag",
        "b"
      ],
      [
        "v",
        "v"
      ],
      [
        "ab",
        "e"
      ],
      [
        "g",
        "f"
      ],
      [
        "aa",
        "m"
      ],
      [
        "k",
        "d"
      ],
      [
        "i",
        "f"
      ],
      [
        "g",
        "e"
      ],
      [
        "aaaa",
        "c"
      ],
      [
        "af",
        "b"
      ],
      [
        "i",
        "c"
      ],
      [
        "bbbb",
        "bbb"
      ],
      [
        "w",
        "w"
      ],
      [
        "aaaa",
        "d"
      ],
      [
        "ag",
        "d"
      ],
      [
        "aa",
        "bbb"
      ],
      [
        "m",
        "b"
      ],
      [
        "h",
        "c"
      ],
      [
        "ab",
        "g"
      ],
      [
        "m",
        "d"
      ],
      [
        "i",
        "g"
      ],
      [
        "aa",
        "acc"
      ],
      [
        "af",
        "d"
      ],
      [
        "f",
        "bb"
      ],
      [
        "aaaa",
        "ab"
      ],
      [
        "ad",
        "e"
      ],
      [
        "a",
        "hh"
      ],
      [
        "o",
        "d"
      ],
      [
        "ee",
        "b"
      ],
      [
        "n",
        "e"
      ],
      [
        "cccc",
        "cccc"
      ],
      [
        "cb",
        "c"
      ],
      [
        "f",
        "dd"
      ],
      [
        "o",
        "b"
      ],
      [
        "c",
        "dd"
      ],
      [
        "ad",
        "g"
      ],
      [
        "cd",
        "b"
      ],
      [
        "aa",
        "n"
      ],
      [
        "aa",
        "cb"
      ],
      [
        "f",
        "cc"
      ],
      [
        "bb",
        "e"
      ],
      [
        "j",
        "c"
      ],
      [
        "h",
        "e"
      ],
      [
        "a",
        "kk"
      ],
      [
        "ab",
        "f"
      ],
      [
        "aa",
        "db"
      ],
      [
        "aa",
        "l"
      ],
      [
        "q",
        "q"
      ],
      [
        "h",
        "bb"
      ],
      [
        "k",
        "bb"
      ],
      [
        "f",
        "i"
      ],
      [
        "ac",
        "g"
      ],
      [
        "acc",
        "cc"
      ],
      [
        "r",
        "r"
      ],
      [
        "ac",
        "e"
      ],
      [
        "aa",
        "add"
      ],
      [
        "ab",
        "aaaa"
      ]
    ]
  }
}