{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "1": 5,
      "a": 6,
      "b": 7,
      "c": 8,
      "d": 9,
      "e": 10,
      "f": 11,
      "g": 12,
      "h": 13,
      "i": 14,
      "j": 15,
      "k": 16,
      "l": 17,
      "m": 18,
      "n": 19,
      "o": 20,
      "p": 21,
      "q": 22,
      "r": 23,
      "s": 24,
      "t": 25,
      "u": 26,
      "v": 27,
      "w": 28,
      "x": 29,
      "y": 30,
      "z": 31,
      "##b": 32,
      "##n": 33,
      "##a": 34,
      "##g": 35,
      "##h": 36,
      "##c": 37,
      "##l": 38,
      "##e": 39,
      "##d": 40,
      "##m": 41,
      "##f": 42,
      "##i": 43,
      "##k": 44,
      "##j": 45,
      "##r": 46,
      "##q": 47,
      "##x": 48,
      "##w": 49,
      "##t": 50,
      "##p": 51,
      "##o": 52,
      "##s": 53,
      "##u": 54,
      "##y": 55,
      "##v": 56,
      "##z": 57,
      "##1": 58,
      "##aa": 59,
      "##bb": 60,
      "##cc": 61,
      "##dd": 62,
      "##aaaa": 63,
      "##ab": 64,
      "##bbbb": 65,
      "##ad": 66,
      "##ac": 67,
      "##ee": 68,
      "##ff": 69,
      "##ag": 70,
      "##ae": 71,
      "##af": 72,
      "##bbb": 73,
      "##ii": 74,
      "##cd": 75,
      "##acc": 76,
      "##hh": 77,
      "##aab": 78,
      "##add": 79,
      "##db": 80,
      "##cb": 81,
      "##ll": 82,
      "##abb": 83,
      "##gg": 84,
      "##cccc": 85,
      "##aad": 86,
      "##aac": 87,
      "##aaa": 88,
      "##ddd": 89,
      "##bbbbbbbb": 90,
      "##kk": 91,
      "##eb": 92,
      "##ed": 93,
      "##ai": 94,
      "##jj": 95,
      "##bd": 96,
      "##aag": 97,
      "##ccc": 98,
      "##aaaaaaaa": 99,
      "##aaab": 100,
      "##fd": 101,
      "##aae": 102,
      "##fb": 103,
      "##dddd": 104,
      "##dc": 105,
      "##ah": 106,
      "##ak": 107,
      "##aj": 108,
      "##aaf": 109,
      "##aaac": 110,
      "##an": 111,
      "##bc": 112,
      "##gd": 113,
      "##am": 114,
      "##ec": 115,
      "##fc": 116,
      "##aaad": 117,
      "##gb": 118,
      "##al": 119,
      "##id": 120,
      "##abbb": 121,
      "##aabb": 122,
      "##nn": 123,
      "##bbbbb": 124,
      "##aee": 125,
      "##hb": 126,
      "##gc": 127,
      "##ao": 128,
      "##tt": 129,
      "##eeee": 130,
      "##kb": 131,
      "##aff": 132,
      "##adb": 133,
      "##ccd": 134,
      "##acd": 135,
      "##aaag": 136,
      "##mm": 137,
      "##aaae": 138,
      "##ib": 139,
      "##acb": 140,
      "##abd": 141,
      "##aacc": 142,
      "##ss": 143,
      "##ld": 144,
      "##ddb": 145,
      "##pp": 146,
      "##llll": 147,
      "##abbbb": 148,
      "##de": 149,
      "##aaaab": 150,
      "##ffff": 151,
      "##fe": 152,
      "##ddc": 153,
      "##adc": 154,
      "##ccb": 155,
      "##bbd": 156,
      "##hhhh": 157,
      "##abc": 158,
      "##accc": 159,
      "##aadd": 160,
      "##aaaf": 161,
      "##addd": 162,
      "##aai": 163,
      "##ge": 164,
      "##ce": 165,
      "##uu": 166,
      "##be": 167,
      "##bbbbbb": 168,
      "##fg": 169,
      "##hd": 170,
      "##cdc": 171,
      "##eee": 172,
      "##jd": 173,
      "##lb": 174,
      "##aq": 175,
      "##bbbbbbbbbbbbbbbb": 176,
      "##bbc": 177,
      "##abab": 178,
      "##adad": 179,
      "##iii": 180,
      "##oo": 181,
      "##aeb": 182,
      "##aaj": 183,
      "##abe": 184,
      "##cac": 185,
      "##aed": 186,
      "##aak": 187,
      "##cf": 188,
      "##dbd": 189,
      "##ar": 190,
      "##aaabb": 191,
      "##gf": 192,
      "##fff": 193,
      "##bbe": 194,
      "##agg": 195,
      "##ap": 196,
      "##aah": 197,
      "##ef": 198,
      "##jb": 199,
      "##nb": 200,
      "##cg": 201,
      "##aii": 202,
      "##acac": 203,
      "##vv": 204,
      "##nd": 205,
      "##ade": 206,
      "##aam": 207,
      "##aaaac": 208,
      "##kd": 209,
      "##if": 210,
      "##agb": 211,
      "##ic": 212,
      "##eg": 213,
      "##bbbbbbb": 214,
      "##ww": 215,
      "##aaaad": 216,
      "##hc": 217,
      "##afb": 218,
      "##aabbb": 219,
      "##agd": 220,
      "##ne": 221,
      "##md": 222,
      "##abg": 223,
      "##aaacc": 224,
      "##afd": 225,
      "##ig": 226,
      "##mb": 227,
      "##od": 228,
      "##fbb": 229,
      "##aaaaab": 230,
      "##ahh": 231,
      "##aacb": 232,
      "##fdd": 233,
      "##cdd": 234,
      "##edd": 235,
      "##cccccccc": 236,
      "##ebb": 237,
      "##rr": 238,
      "##adg": 239,
      "##aan": 240,
      "##fcc": 241,
      "##ob": 242,
      "##cdb": 243,
      "##jc": 244,
      "##eeb": 245,
      "##he": 246,
      "##cbc": 247,
      "##akk": 248,
      "##aadb": 249,
      "##qq": 250,
      "##fi": 251,
      "##hbb": 252,
      "##aal": 253,
      "##acg": 254,
      "##abf": 255
    }
  }
}